In [2]:
import pandas as pd 
import numpy as np

# pd.Series

In [3]:
labels = ["a", "b","c"]
my_list = [10,20,30]
arr = np.array(my_list)
arr

array([10, 20, 30])

In [4]:
d = {'a':10, 'b':20, 'c':30}
pd.Series(data=my_list) #msma coisa
pd.Series(data=arr) #msma coisa
''''
0    10
1    20
2    30
dtype: int64
'''
pd.Series(data=arr, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
ser1= pd.Series([1,2,3,4], 
          index=['USA','Germany', 'USSR', 'Japan'])

In [6]:
ser1['USA']

np.int64(1)

# Df

In [7]:
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(6,4),index='A B C D E F'.split(),columns='W X Y Z'.split())
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967
F  0.302665 -1.706086

In [8]:
df['NEW'] = df['W']+df['Y'] # adicionar coluna
df.drop(['NEW'], axis=1, inplace=False) # axis=0 é row; inplace = True pra remover permanentemente

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
F  0.302665  1.693723 -1.706086 -1.159119

In [9]:
#selecting rows
df.loc[['A'], ['W', 'X'] ] # poderia selecionar por index tbm
''''
	W	X
A	2.70685	0.628133
'''
df [ df['W'] > 0 ] ['Y'] #se W for menor que 0, corta. Mostra só coluna Y

df[(df['W'] > 0 ) & (df['X'] > 0 )] #2 condições; mostra tabela inteira

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
E  0.190794  1.978757  2.605967  0.683509  2.796762
F  0.302665  1.693723 -1.706086 -1.159119 -1.403420

In [10]:
df.reset_index(inplace=True)

In [11]:
new_ind = 'AA BB CC DD EE FF'.split()
df['XX']= new_ind
df.set_index('XX') #alterando o index momentaneamente (inplace false)

   index         W         X         Y         Z       NEW
XX
AA     A  2.706850  0.628133  0.907969  0.503826  3.614819
BB     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
CC     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
DD     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
EE     E  0.190794  1.978757  2.605967  0.683509  2.796762
FF     F  0.302665  1.693723 -1.706086 -1.159119 -1.403420

In [12]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   6 non-null      object
 1   W       6 non-null      float64
 2   X       6 non-null      float64
 3   Y       6 non-null      float64
 4   Z       6 non-null      float64
 5   NEW     6 non-null      float64
 6   XX      6 non-null      object
dtypes: float64(5), object(2)
memory usage: 468.0+ bytes

              W         X         Y         Z       NEW
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.336992  0.660424  0.092558  0.166706  0.429551
std    1.503744  1.075862  1.571280  0.839534  2.216421
min   -2.018168 -0.758872 -1.706086 -1.159119 -1.489355
25%    0.189220 -0.082455 -0.911947 -0.315794 -1.238701
50%    0.246730  0.684127 -0.159632  0.554896 -0.470750
75%    0.564005  1.455323  0.813180  0.664123  2.048331
max    2.706850  1.978757  2.605967  0.955057  3.614819

# Groupby

In [13]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [14]:
df.groupby('Company').max()
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Operations

In [15]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df['col1'].nunique() #4
df.value_counts()

col1  col2  col3
1     444   abc     1
2     555   def     1
3     666   ghi     1
4     444   xyz     1
Name: count, dtype: int64

In [17]:
newdf = df[ (df['col1'] > 2) & (df['col2'] == 444)]
newdf

   col1  col2 col3
3     4   444  xyz